Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: རྣམ་པར་ཐར་པ་དང་། མཐར་གྱི་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་མི་ཟད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: V: 79} the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways.

source: །རབ་འབྱོར་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་མི་ཟད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, the perfection of wisdom should be brought into being through the inexhaustibility of the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas.

source: །རབ་འབྱོར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མི་ཟད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, the perfection of wisdom should be brought into being through the inexhaustibility of [the goals], up to and including all-aspect omniscience. “

source: །རབ་འབྱོར་གཞན་ཡང་གཟུགས་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Moreover, Subhūti, bodhisattva great beings should actualize the perfection of wisdom through the inexhaustible space-like nature of physical forms.

source: །རབ་འབྱོར་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, bodhisattva great beings should actualize the perfection of wisdom through the inexhaustible space-like nature of feelings, perceptions, formative predispositions, and consciousness.

source: །རབ་འབྱོར་སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, bodhisattva great beings should actualize the perfection of wisdom through the inexhaustible space-like nature of the sense fields, the sensory elements, and the links of dependent origination.

source: །རབ་འབྱོར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, they should actualize the perfection of wisdom through the inexhaustible space-like nature of the perfection of generosity.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: They should actualize the perfection of wisdom through the inexhaustible space-like nature of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: །རབ་འབྱོར་ནང་སྟོང་པ་ཉིད་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, they should actualize the perfection of wisdom through the inexhaustible space-like nature of the emptiness of internal phenomena.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: They should actualize the perfection of wisdom through the inexhaustible space-like nature of [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །རབ་འབྱོར་དྲན་པ་ཉེ་བར་གཞག་པ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ། །ཡང་དག་པར་སྤོང་བ་དང་།
en: Subhūti, they should actualize the perfection of wisdom through the inexhaustible space-like nature of the applications of mindfulness.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ། །རབ་འབྱོར་འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་།
en: They should actualize the perfection of wisdom through the inexhaustible space-like nature of the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, they should actualize the perfection of wisdom through the inexhaustible space-like nature of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways.

source: །རབ་འབྱོར་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, they should actualize the perfection of wisdom through the inexhaustible space-like nature of the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas.

source: །རབ་འབྱོར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, they should actualize the perfection of wisdom through the inexhaustible space-like nature of [the goals], up to and including all-aspect omniscience. “

source: །རབ་འབྱོར་གཞན་ཡང་མ་རིག་པ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Moreover, Subhūti, bodhisattva great beings should actualize the perfection of wisdom through the inexhaustible space-like nature of ignorance.

source: །རབ་འབྱོར་འདུ་བྱེད་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, bodhisattva great beings should actualize the perfection of wisdom through the inexhaustible space-like nature of formative predispositions.

source: །རབ་འབྱོར་རྣམ་པར་ཤེས་པ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, bodhisattva great beings should actualize the perfection of wisdom through the inexhaustible space-like nature of consciousness.

source: །རབ་འབྱོར་མིང་དང་གཟུགས་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, bodhisattva great beings should actualize the perfection of wisdom through the inexhaustible space-like nature of name and form.

source: །རབ་འབྱོར་སྐྱེ་མཆེད་དྲུག་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, bodhisattva great beings should actualize the perfection of wisdom through the inexhaustible space-like nature of the six sense fields.

source: །རབ་འབྱོར་རེག་པ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, bodhisattva great beings should actualize the perfection of wisdom through the inexhaustible space-like nature of sensory contact.

source: །རབ་འབྱོར་ཚོར་བ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, bodhisattva great beings should actualize the perfection of wisdom through the inexhaustible space-like nature of sensation.

source: །རབ་འབྱོར་སྲེད་པ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, bodhisattva great beings should actualize the perfection of wisdom through the inexhaustible space-like nature of craving.

source: །རབ་འབྱོར་ལེན་པ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, bodhisattva great beings should actualize the perfection of wisdom through the inexhaustible space-like nature of grasping.

source: །རབ་འབྱོར་སྲིད་པ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, bodhisattva great beings should actualize the perfection of wisdom through the inexhaustible space-like nature of the rebirth process.

source: །རབ་འབྱོར་སྐྱེ་བ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ། །རབ་འབྱོར་རྒ་ཤི་དང་།
en: Subhūti, bodhisattva great beings should actualize the perfection of wisdom through the inexhaustible space-like nature of birth. {

source: མྱ་ངན་དང་།
en: Ki.

source: སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱ་སྟེ།
en: V: 80} Subhūti, bodhisattva great beings should actualize the perfection of wisdom through the inexhaustible space-like nature of aging, death, sorrow, lamentation, suffering, discomfort, and agitation.

source: རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, it is in that manner that bodhisattva great beings should actualize the perfection of wisdom. “

source: །རབ་འབྱོར་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་རྣམ་པར་ལྟ་བ་དང་། ཤིན་དུ་རྣམ་པར་སྤང་བ་ལ་རྣམ་པར་ལྟ་བ་སྟེ།
en: Subhūti, this is the observation of the links of dependent origination that bodhisattva great beings make, the observation of that which they have absolutely renounced.

source: གང་དེ་ལྟར་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་རྣམ་པར་ལྟ་བ་དེ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་པོ་བྱང་ཆུབ་ལ་འདུག་པའི་མ་འདྲེས་པའི་ཆོས་ཏེ།
en: To observe the links of dependent origination is a distinct attribute of bodhisattva great beings who are seated at the site of enlightenment.

source: དེ་ལྟར་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་རྣམ་པར་ལྟ་བ་དེས་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཐོབ་པར་འགྱུར་རོ།
en: By observing the links of dependent origination in that manner they will attain the wisdom of all-aspect omniscience.

source: །རབ་འབྱོར་གང་ལ་ལ་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས་མངོན་པར་བསྒྲུབ་པ་འདིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་རྣམ་པར་ལྟ་བ་དེ་ནི། ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་ས་ལ་གནས་པར་མི་འགྱུར་ཏེ། དེ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་གནས་པར་འགྱུར་རོ།
en: Subhūti, those who practice the perfection of wisdom through this actualization of space-like inexhaustibility and observe the links of dependent origination will not dwell on the level of the śrāvakas, or the level of the pratyekabuddhas, but they will dwell in unsurpassed, complete enlightenment. “

source: །རབ་འབྱོར་གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་གང་ཕྱིར་ལྡོག་པ་དེ་དག་ཐམས་ཅད་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡིད་ལ་བྱ་བ་འདི་ལ་མ་བརྟེན་པ་དང་།
en: Subhūti, all those individual followers of the vehicle of the bodhisattvas who are reversible do not rely on this directing of their minds to the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཇི་ལྟར་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པས་མངོན་པར་བསྒྲུབ་པས་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་རྣམ་པར་བལྟ་བར་བྱ་བ་དང་། མངོན་པར་བསྒྲུབ་པར་བྱ་བ་མི་ཤེས་པས་ཕྱིར་ལྡོག་གོ །
en: They turn back because they do not know how bodhisattva great beings, when they practice the perfection of wisdom, should observe the links of dependent origination by actualizing space-like inexhaustibility.

source: རབ་འབྱོར་གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་ཕྱིར་ལྡོག་པ་དེ་དག་ཐམས་ཅད་ནི་ཐབས་མཁས་པ་འདི་ལ་མ་རྟེན་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་ལྡོག་གོ །
en: Subhūti, all those individual followers of the vehicle of the bodhisattvas who are reversible turn back from unsurpassed, complete enlightenment because they do not rely on this skill in means.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་བརྟེན་པས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་སྟེ།
en: Subhūti, all those bodhisattva great beings who indeed do not turn back from unsurpassed, complete enlightenment do not turn back from unsurpassed, complete enlightenment because they rely on this perfection of wisdom.

source: དེ་ལྟར་ཐབས་མཁས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནམ་མཁའ་ལྟར་ཟད་མི་ཤེས་པ་མངོན་པར་བསྒྲུབ་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་བལྟ་བར་བྱ། མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Bodhisattva great beings who practice the perfection of wisdom in that manner, with skill in means, should observe and actualize the perfection of wisdom by actualizing space-like inexhaustibility. “

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་རྣམ་པར་བལྟ་བས་ནི། ཆོས་གང་ཡང་རྒྱུ་མེད་པ་ལས་བྱུང་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: Subhūti, by observing the links of dependent origination in that manner, bodhisattva great beings do not observe anything that originates without a cause.

source: ཆོས་གང་ཡང་རྟག་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: They do not observe anything that is permanent.

source: ཆོས་གང་ཡང་འགག་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཆོས་གང་ཡང་བདག་དང་། སེམས་ཅན་དང་། སྲོག་དང་། འགྲོ་བ་དང་།
en: They do not observe anything that ceases.

source: གསོ་བ་དང་སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་ཅན་དང་། ཤེད་བདག་དང་། བྱེད་པ་པོ་དང་། བྱེད་དུ་འཇུག་པ་པོ་དང་། སློང་བ་པོ་དང་། ཡོངས་སུ་སློང་བ་པོ་དང་། ཚོར་བ་པོ་དང་། ཚོར་དུ་འཇུག་པ་པོ་དང་། ཤེས་པ་པོ་དང་། ལྟ་བ་པོར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། རྟག་པ་དང་།
en: They do not observe anything that constitutes a self, being, life form, living being, life, living creature, individual personality, human being, person, actor, agent, petitioner, instigator, experiencer, knower, or viewer.

source: མི་རྟག་པ་དང་། བདེ་བ་དང་སྡུག་བསྔལ་བ་དང་། བདག་དང་བདག་མེད་པ་དང་། ཞི་བ་དང་། མ་ཞི་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: They do not observe anything permanent, impermanent, imbued with happiness or suffering, with self or without self, or at peace or not at peace.

source: རབ་འབྱོར་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་རྣམ་པར་བལྟ་བར་བྱའོ།
en: Subhūti, when they practice the perfection of wisdom in that manner, bodhisattva great beings should observe the links of dependent origination. {

source: །རབ་འབྱོར་གང་གི་ཚེ།
en: Ki.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེའི་ཚེ། གཟུགས་རྟག་པ་འམ། མི་རྟག་པ་འམ། བདེ་བ་འམ་སྡུག་བསྔལ་བ་འམ། བདག་ཡོད་པ་འམ།
en: V: 81} “Subhūti, at the time when bodhisattva great beings practice the perfection of wisdom, they do not observe that physical forms are permanent, impermanent, imbued with happiness or suffering, with self or without self, or at peace or not at peace.

source: བདག་མེད་པ་འམ། ཞི་བ་འམ། མ་ཞི་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །ཚོར་བ་དང་འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རྟག་པ་འམ། མི་རྟག་པ་འམ། བདེ་བ་འམ། སྡུག་བསྔལ་བ་འམ། བདག་ཡོད་པ་འམ། བདག་མེད་པ་འམ། ཞི་བ་འམ་མ་ཞི་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་རྟག་པ་འམ། མི་རྟག་པ་འམ།
en: They do not observe that feelings, perceptions, formative predispositions, or consciousness is permanent, impermanent, imbued with happiness or suffering, with self or without self, or at peace or not at peace.

source: བདེ་བ་འམ། སྡུག་བསྔལ་བ་འམ། བདག་ཡོད་པ་འམ། བདག་མེད་པ་འམ། ཞི་བའ་མ་མ་ཞི་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: They do not observe that the sense fields, the sensory elements, or the links of dependent origination are permanent, impermanent, imbued with happiness or suffering, with self or without self, or at peace or not at peace.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་རྟག་པ་འམ། མི་རྟག་པ་འམ། བདེ་བ་འམ། སྡུག་བསྔལ་བ་འམ། བདག་ཡོད་པ་འམ། བདག་མེད་པ་འམ། ཞི་བ་འམ། མ་ཞི་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། མངོན་པར་ཤེས་པ་དང་། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་།
en: They do not observe that all the perfections, all the aspects of emptiness, or the thirty-seven factors conducive to enlightenment are permanent, impermanent, imbued with happiness or suffering, with self or without self, or at peace or not at peace.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་རྟག་པ་འམ། མི་རྟག་པ་འམ། བདེ་བ་འམ། སྡུག་བསྔལ་བ་འམ། བདག་ཡོད་པ་འམ། བདག་མེད་པ་འམ། ཞི་བ་འམ།
en: They do not observe that the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, emptiness, signlessness, wishlessness, the aspects of liberation, [the serial steps of meditative absorption], the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers [of the tathāgatas], the four fearlessnesses, the four kinds of exact knowledge, or the eighteen distinct qualities of the buddhas are permanent, impermanent, imbued with happiness or suffering, with self or without self, or at peace or not at peace.

source: མ་ཞི་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་རྟག་པ་འམ། མི་རྟག་པ་འམ། བདེ་བ་འམ། སྡུག་བསྔལ་བ་འམ། བདག་ཡོད་པ་འམ། བདག་མེད་པ་འམ། ཞི་བ་འམ།
en: They do not observe that [the goals], up to and including all-aspect omniscience, are permanent, impermanent, imbued with happiness or suffering, with self or without self, or at peace or not at peace. “

source: མ་ཞི་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: If you ask why, Subhūti, it is because when bodhisattva great beings practice the perfection of wisdom, they do not observe the perfection of wisdom.

source: ཆོས་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་འགྱུར་བའི་ཆོས་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe anything at all through which they would observe the perfection of wisdom.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: They do not observe the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, or the perfection of generosity.

source: ཆོས་གང་གིས་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་འགྱུར་བའི་ཆོས་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe anything at all through which they would observe the perfection of generosity [and so forth].

source: །ནང་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: They do not observe the emptiness of internal phenomena.

source: ཆོས་གང་གིས་ནང་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་འགྱུར་བའི་ཆོས་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe anything at all through which they would observe the emptiness of internal phenomena.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: They do not observe [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: ཆོས་གང་གིས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་འགྱུར་བའི་ཆོས་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་།
en: They do not observe anything at all through which they would observe the emptiness of the essential nature of nonentities [and so forth].

source: ཆོས་གང་གིས་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་འགྱུར་བའི་ཆོས་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe anything at all through which they would observe the noble eightfold path [and so forth].

source: །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: They do not observe the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, {Ki.

source: རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་།
en: V: 82} the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, or the dhāraṇī gateways.

source: མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ། ཆོས་གང་གིས་གཟུངས་ཀྱི་སྒོ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་འགྱུར་བའི་ཆོས་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe anything at all through which they would observe the dhāraṇī gateways [and so forth].

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: They do not observe the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, or the eighteen distinct qualities of the buddhas.

source: ཆོས་གང་གིས་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་འགྱུར་བའི་ཆོས་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe anything at all through which they would observe the eighteen distinct qualities of the buddhas [and so forth].

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: They do not observe [the goals], up to and including all-aspect omniscience.

source: ཆོས་གང་གིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡང་དག་པར་རྗེས་སུ་མཐོང་བར་འགྱུར་བའི་ཆོས་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe anything at all through which they would observe all-aspect omniscience [and so forth].

source: །ཆོས་གང་གིས་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་སྤང་བར་བྱ་བ་དེ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe anything through which they should abandon all reincarnation through the continuity of propensities.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་ཐམས་ཅད་མི་དམིགས་པའི་ཚུལ་གྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ།
en: Subhūti, so it is that bodhisattva great beings should practice the perfection of wisdom without apprehending anything. “

source: །རབ་འབྱོར་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་མི་དམིགས་པར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེའི་ཚེ། བདུད་སྡིག་ཏོ་ཅན་མྱ་ངན་གྱི་ཟུག་རྔུས་ཟུག་པར་འགྱུར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Subhūti, at the time when bodhisattva great beings practice the perfection of wisdom without apprehending anything, the evil Māra will be pierced with the pain of sorrow.

source: སྐྱེས་བུ་ཞིག་ཕ་མ་འཆི་བའི་དུས་བྱས་པར་གྱུར་ན། མྱ་ངན་གྱི་ཟུག་རྔུས་ཟུག་པར་འགྱུར་ཏེ། མྱ་ངན་གྱི་ཟུག་རྔུ་མི་བཟད་པ་དང་ལྡན་པར་འགྱུར་རོ། །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་མི་དམིགས་པར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བདུད་སྡིག་ཏོ་ཅན་མྱ་ངན་གྱི་ཟུག་རྔུས་ཟུག་པར་འགྱུར་ཏེ།
en: Subhūti, just as a person is pierced with the pain of sorrow at the time when their parents die, and the pains of sorrow they experience will be unbearable, in the same way, Subhūti, when bodhisattva great beings practice the perfection of wisdom without apprehending anything, the evil Māra will be pierced with the pain of sorrow, and the pains of sorrow he experiences will be unbearable.”
